import xlwt

disease_condition_dict = {
    "N95.201": {"age": ["(40-70]", "(70-)"], "gender": ["女"], "systems": "女性系统", "icd10_name": "老年性阴道炎",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D66xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "血友病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N41.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["男"], "systems": "泌尿生殖",
                "icd10_name": "前列腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M72.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "纤维织炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L50.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "荨麻疹", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K74.609": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肝硬化", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I69.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑梗死后遗症", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B37.301+N77.1*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                       "icd10_name": "念珠菌性阴道炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K40.900": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "腹股沟疝", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N13.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "肾积水", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K81.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性胆囊炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G47.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "失眠", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N03.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "慢性肾小球肾炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "H52.701": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "屈光不正", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "P59.902": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "新生儿黄疸", "require_lab": "是",
                "typo": ["急诊", "门诊", "住院"]},
    "K58.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肠易激综合征", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C73xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "甲状腺恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I10xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "高血压", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J20.905": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "急性气管支气管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K59.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "便秘", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C15.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "食管恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J03.904": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性扁桃体炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N45.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "睾丸炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L23.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "过敏性皮炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G20xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "帕金森病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M87.851": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "股骨头缺血坏死", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M81.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "骨质疏松", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K04.005": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "牙髓炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L73.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "毛囊炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I27.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "肺源性心脏病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G43.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "偏头痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B35.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "头癣", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K81.004": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "急性胆囊炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J01.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性鼻窦炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M32.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "系统性红斑狼疮", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "G51.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "面神经麻痹", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K63.582": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "结肠息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M19.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "骨关节病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J31.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性咽炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I69.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑出血后遗症", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M35.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "重叠综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N93.801": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "功能性子宫出血",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N20.005": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "肾结石", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N20.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "输尿管结石", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J44.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "慢性阻塞性肺疾病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E14.423+G63.2*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                       "icd10_name": "糖尿病性周围神经病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J45.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "支气管哮喘", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C20xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "直肠恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J02.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性咽炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A74.001+H13.1*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                       "icd10_name": "衣原体性结膜炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K50.900": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "克罗恩病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L40.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "银屑病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J21.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "急性毛细支气管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E79.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "高尿酸血症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "G45.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "短暂性脑缺血发作", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H10.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "变应性结膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H60.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "外耳道炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L08.921": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "软组织感染", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M34.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "系统性硬化症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "E87.601": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "低钾血症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "D27xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "卵巢良性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H16.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "角膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I00xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "风湿热", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N94.401": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "原发性痛经",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M33.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "皮肌炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "J93.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "自发性气胸", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A09.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胃肠炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B35.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "甲癣", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J30.401": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "过敏性鼻炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D25.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫平滑肌瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C16.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胃恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H66.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性化脓性中耳炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K80.203": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胆囊结石", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I73.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "血栓闭塞性脉管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K76.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "脂肪肝", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B35.603": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "股癣", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G31.905": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑萎缩", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N40xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["男"], "systems": "泌尿生殖",
                "icd10_name": "前列腺增生", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K51.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "溃疡性结肠炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I80.205": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "下肢深静脉血栓", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H81.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "梅尼埃病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N73.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "女性盆腔炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K26.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "十二指肠溃疡", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M54.501": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腰肌劳损", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K56.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肠套叠", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K60.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肛裂", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L70.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "痤疮", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E28.201": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "多囊卵巢综合征",
                "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N75.801": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "前庭大腺炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G40.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "癫痫", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J47xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "支气管扩张", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H65.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "分泌性中耳炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C22.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肝恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K35.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "急性阑尾炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N02.801": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "IgA肾病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I63.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "腔隙性脑梗死", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K92.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胃肠功能紊乱", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K80.502": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胆管结石", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M35.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "白塞病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N10xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "急性肾盂肾炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K12.105": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "口腔黏膜溃疡", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N76.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "细菌性阴道炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "H26.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "白内障", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G44.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "紧张性头痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M47.921": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "颈椎病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E06.303": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "自身免疫性甲状腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "L80xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "白癜风", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J37.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性喉炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M51.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腰椎间盘突出症", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K65.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "腹膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J06.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "上呼吸道感染", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N94.301": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "经前期紧张综合征",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I50.904": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "急性心力衰竭", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M83.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "骨软化症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K86.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性胰腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M10.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "痛风", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "G44.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "丛集性头痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N80.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫内膜异位", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I50.905": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "慢性心力衰竭", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N76.203": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "外阴炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C18.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "结肠恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J42xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "慢性支气管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B02.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "带状疱疹", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C50.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "女性系统",
                "icd10_name": "乳腺恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E78.501": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "高脂血症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K22.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "贲门失弛缓症", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N95.101": {"age": ["(40-70]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "更年期综合征", "require_lab": "否",
                "typo": ["急诊", "门诊", "住院"]},
    "A53.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "梅毒", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "C34.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D69.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "过敏性紫癜", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I63.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑梗死", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K05.105": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "龈炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K85.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "急性胰腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M06.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "类风湿性关节炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K61.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肛周脓肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J32.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性鼻窦炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N04.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "肾病综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K29.501": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性胃炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E05.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "甲状腺功能亢进", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "D26.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫腺肌病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G47.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "睡眠呼吸暂停低通气综合征", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K36xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性阑尾炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G70.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "重症肌无力", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N92.603": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "月经紊乱",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I67.803": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑血管供血不足", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H66.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性化脓性中耳炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G50.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "三叉神经痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K25.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胃溃疡", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M75.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肩周炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M35.006": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "干燥综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "H11.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "翼状胬肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H10.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "细菌性结膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M35.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "混合性结缔组织病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "L30.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "湿疹", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A60.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "生殖器疱疹", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I24.803": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "急性冠脉综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "J18.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J85.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺脓肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K29.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "急性胃炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K56.702": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肠梗阻", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J35.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性扁桃体炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E03.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "甲状腺功能减退", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N18.905": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "慢性肾功能不全", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "D50.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "缺铁性贫血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K04.401": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "急性根尖周炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N21.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "膀胱结石", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E20.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "甲状旁腺功能减退症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "J84.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "间质性肺炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H81.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "良性阵发性位置性眩晕", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J00xx04": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性鼻炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D24xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "女性系统",
                "icd10_name": "乳腺良性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A16.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺结核", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N75.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "前庭大腺囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K21.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "反流性食管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C25.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胰腺恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N62xx04": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "乳腺增生", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G30.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "阿尔茨海默病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D69.302": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "特发性血小板减少性紫癜", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M45xx091": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                 "icd10_name": "强直性脊柱炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "B18.106": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性乙型病毒性肝炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I73.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "风湿免疫",
                "icd10_name": "雷诺综合征", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K92.204": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "上消化道出血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "A59.002+N77.1*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                       "icd10_name": "滴虫性阴道炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N72xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫颈炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C67.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "膀胱恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C85.906": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "淋巴瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J31.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "慢性鼻炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N61xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "女性系统",
                "icd10_name": "急性乳腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I26.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺血栓栓塞症", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E14.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "糖尿病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K82.808": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胆囊息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I84.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "痔疮", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B26.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "传染及寄生虫病",
                "icd10_name": "流行性腮腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "A01.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "传染及寄生虫病",
                "icd10_name": "伤寒", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "B66.302": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "传染及寄生虫病",
                "icd10_name": "肝片吸虫病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "B24xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "传染及寄生虫病",
                "icd10_name": "艾滋病[获得性免疫缺陷综合征]", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I88.906": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "淋巴结炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "T67.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "中暑", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "F10.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "急性酒精中毒", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "W59.994": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "动物咬伤或造成损伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H73.802": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "鼓膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S22.321": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肋骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N47xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "包茎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C90.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "多发性骨髓瘤", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "S92.302": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "跖骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C56xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "卵巢恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "髌骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S72.103": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "股骨粗隆间骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S01.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "头皮开放性损伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E28.304": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "卵巢早衰", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "B18.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "慢性丙型病毒性肝炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "E04.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "结节性甲状腺肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S32.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腰椎骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N83.205": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "卵巢囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "T09.205": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "躯干关节扭伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D61.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "再生障碍性贫血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M54.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "坐骨神经痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N91.201": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "闭经",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N43.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "睾丸鞘膜积液", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J35.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "儿科",
                "icd10_name": "腺样体肥大", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J38.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "声带息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N84.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫内膜息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M48.061": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腰椎管狭窄", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G58.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "肋间神经痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S83.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "膝半月板撕裂", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.401": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腓骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D56.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "地中海贫血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K02.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "龋病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J34.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "鼻中隔偏曲", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I42.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "扩张性心肌病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A46xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "丹毒", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K42.902": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "脐疝", "require_lab": "否",
                "typo": ["急诊", "门诊", "住院"]},
    "T14.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "身体浅表损伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D34xx02": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "甲状腺良性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J33.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "鼻息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L72.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "表皮囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J38.203": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "声带小结", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M65.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "滑膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N85.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫内膜增生", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G62.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "多发性神经病[多发性神经炎/周围神经炎]", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.187": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "胫骨平台骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "F03xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "痴呆", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K05.205": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "急性牙周炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I51.403": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "心肌炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K05.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "慢性牙周炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L75.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "腋臭[臭汗症]", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I20.805": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "稳定型心绞痛", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H04.401": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "慢性泪囊炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E22.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "高泌乳素血症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M77.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肱骨外上髁炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H04.503": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "泪道阻塞", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E30.101": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "性早熟", "require_lab": "是",
                "typo": ["急诊", "门诊", "住院"]},
    "C61xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "前列腺癌", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "C54.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "子宫内膜恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K62.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "直肠息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K83.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胆管炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B01.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "水痘", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "Q61.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "肾囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L27.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "药物性皮炎[药疹]", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E04.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "单纯性甲状腺肿", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "I83.904": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "下肢静脉曲张", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I49.904": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "心律失常", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S52.302": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "桡骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D22.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "痣", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.502": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "内踝骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N96xx01": {"age": ["(15-40]", "(40-70]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "习惯性流产",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S42.411": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肱骨髁上骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B08.501": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "疱疹性咽峡炎", "require_lab": "否",
                "typo": ["急诊", "门诊", "住院"]},
    "C11.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "鼻咽恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S42.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肱骨干骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N49.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "精囊炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "J94.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "血气胸", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "T35.701": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "冻伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S86.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "跟腱断裂", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M71.991": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "滑囊炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L03.091": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "甲沟炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H90.501": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "感音神经性聋", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S05.104": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "眼球挫伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S62.601": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "指骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.211": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "胫腓骨干骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A63.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "尖锐湿疣", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M85.652": {"age": ["(15-40]", "(40-70]", "(70-)"], "gender": ["女", "男"], "systems": "运动系统", "icd10_name": "坐骨结节囊肿",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S43.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肩关节脱位", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I11.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "高血压性心脏病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G61.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "吉兰-巴雷综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "L72.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "皮脂囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K62.815": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "直肠炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N39.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "无症状菌尿", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N39.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "下尿路感染", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M67.491": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腱鞘囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S62.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "掌骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D46.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "骨髓增生异常综合征", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "C95.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "白血病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "E14.550": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "糖尿病足", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S72.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "股骨干骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S52.011": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "尺骨鹰嘴骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G56.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腕管综合征", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S92.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "跟骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I88.001": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "肠系膜淋巴结炎", "require_lab": "否",
                "typo": ["急诊", "门诊", "住院"]},
    "K52.904": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "幼儿腹泻", "require_lab": "否",
                "typo": ["急诊", "门诊", "住院"]},
    "C64xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "肾恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K62.806": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肛乳头肥大", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S52.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "尺骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H02.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "睑内翻", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H02.002": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "倒睫", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N48.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "包皮龟头炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "C53.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女"], "systems": "女性系统",
                "icd10_name": "宫颈恶性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D17.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "脂肪瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H33.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "视网膜脱离", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.282": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "胫骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E14.221+N08.3*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                       "icd10_name": "糖尿病性肾病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "M50.202": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "颈椎间盘突出", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S42.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "锁骨骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E14.371+H36.0*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                       "icd10_name": "糖尿病性视网膜病变", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I09.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "循环系统",
                "icd10_name": "风湿性心脏病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E23.007": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "垂体功能减退症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "S61.903": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "手部开放性损伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.602": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "外踝骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K71.601": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "药物性肝炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "O00.901": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "异位妊娠",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M65.992": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "腱鞘炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N45.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "附睾炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S72.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "股骨颈骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K41.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "股疝", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "G56.205": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "肘管综合征", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K76.811": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肝囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D56.104": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "重型地中海贫血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "N00.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "急性肾小球肾炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "D53.101": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "血液系统",
                "icd10_name": "巨幼红细胞性贫血", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "O20.001": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "先兆流产",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S72.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "股骨粗隆下骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S01.105": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "眼睑裂伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I86.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "泌尿生殖",
                "icd10_name": "精索静脉曲张", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "E55.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "儿科",
                "icd10_name": "活动性佝偻病", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "D35.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "垂体良性肿瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N97.903": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "继发不孕",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "M71.201": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "腘窝囊肿", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "N97.904": {"age": ["(15-40]", "(40-70]", "[0-15]"], "gender": ["女"], "systems": "女性系统", "icd10_name": "原发不孕",
                "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D18.030": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肝血管瘤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "I61.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "脑出血", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B37.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "口腔科",
                "icd10_name": "口腔念珠菌病[鹅口疮]", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "K60.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肛瘘", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "J04.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "耳鼻喉",
                "icd10_name": "急性喉炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "R94.501": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "肝功能异常", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "G35xx01": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "神经系统",
                "icd10_name": "多发性硬化", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "T30.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "烧伤", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "A09.908": {"age": ["[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "小儿肠炎", "require_lab": "是",
                "typo": ["急诊", "门诊", "住院"]},
    "E06.102": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "亚急性甲状腺炎", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "E83.502": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "内分泌系统",
                "icd10_name": "低钙血症", "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "B35.301": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "足癣", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "L25.901": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "皮肤性病",
                "icd10_name": "接触性皮炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "K31.701": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "消化系统",
                "icd10_name": "胃息肉", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "S82.811": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "运动系统",
                "icd10_name": "双踝骨折", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "D86.001": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "肺结节病", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "R09.103": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "呼吸系统",
                "icd10_name": "胸膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B08.401": {"age": ["(15-40]", "[0-15]"], "gender": ["女", "男"], "systems": "儿科", "icd10_name": "手足口病",
                "require_lab": "是", "typo": ["急诊", "门诊", "住院"]},
    "H40.902": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "青光眼", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H00.003": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "睑腺炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "H20.904": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                "icd10_name": "葡萄膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]},
    "B30.901+H13.1*": {"age": ["(15-40]", "(40-70]", "(70-)", "[0-15]"], "gender": ["女", "男"], "systems": "眼科",
                       "icd10_name": "病毒性结膜炎", "require_lab": "否", "typo": ["急诊", "门诊", "住院"]}}
if __name__ == '__main__':
    _dict = {}

    for data in """20 传染及寄生虫病/A01.001_0
       0 传染及寄生虫病/B24xx01_0
       0 传染及寄生虫病/B26.901_0
       0 传染及寄生虫病/B66.302_0
       0 儿科/A09.908_0
       0 儿科/B08.401_0
       0 儿科/B08.501_0
    4845 儿科/E30.101_0
     287 儿科/E55.001_0
       0 儿科/I88.001_0
       0 儿科/J35.201_0
       0 儿科/K42.902_0
       0 儿科/K52.904_0
       0 儿科/P59.902_0
       0 内分泌系统/C73xx01_0
       0 内分泌系统/D34xx02_0
       0 内分泌系统/E03.901_0
     109 内分泌系统/E04.001_0
       0 内分泌系统/E04.902_0
       0 内分泌系统/E05.901_0
       0 内分泌系统/E06.102_0
       0 内分泌系统/E06.303_0
       0 内分泌系统/E14.901_0
      25 内分泌系统/E20.901_0
       0 内分泌系统/E22.101_0
       2 内分泌系统/E23.007_0
       0 内分泌系统/E78.501_0
       0 内分泌系统/E83.502_0
       0 内分泌系统/E87.601_0
       0 内分泌系统/M81.991_0
       0 内分泌系统/M83.991_0
       0 口腔科/B37.001_0
       0 口腔科/K02.901_0
       0 口腔科/K04.005_0
       0 口腔科/K04.401_0
       0 口腔科/K05.105_0
       1 口腔科/K05.205_0
       0 口腔科/K05.301_0
       0 口腔科/K12.105_0
       0 呼吸系统/A16.202_0
       0 呼吸系统/C34.901_0
       0 呼吸系统/D86.001_0
       0 呼吸系统/G47.301_0
       0 呼吸系统/I26.903_0
       0 呼吸系统/J06.903_0
       0 呼吸系统/J18.901_0
       0 呼吸系统/J20.905_0
       0 呼吸系统/J21.902_0
       0 呼吸系统/J42xx02_0
       0 呼吸系统/J44.901_0
       0 呼吸系统/J45.901_0
       0 呼吸系统/J47xx01_0
       0 呼吸系统/J84.902_0
       0 呼吸系统/J85.201_0
       0 呼吸系统/J93.101_0
      49 呼吸系统/J94.202_0
       0 呼吸系统/R09.103_0
       0 女性系统/A59.002+N77.1*_0
       0 女性系统/B37.301+N77.1*_0
       0 女性系统/C50.902_0
       0 女性系统/C53.902_0
       0 女性系统/C54.101_0
       0 女性系统/C56xx02_0
       0 女性系统/D24xx01_0
       0 女性系统/D25.902_0
       0 女性系统/D26.102_0
       0 女性系统/D27xx01_0
       0 女性系统/E28.201_0
       0 女性系统/E28.304_0
       0 女性系统/N61xx01_0
       0 女性系统/N62xx04_0
       0 女性系统/N72xx02_0
       0 女性系统/N73.901_0
       0 女性系统/N75.001_0
       0 女性系统/N75.801_0
       0 女性系统/N76.003_0
       0 女性系统/N76.203_0
       0 女性系统/N80.001_0
       0 女性系统/N83.205_0
       0 女性系统/N84.001_0
       0 女性系统/N85.001_0
       0 女性系统/N91.201_0
       0 女性系统/N92.603_0
       0 女性系统/N93.801_0
       0 女性系统/N94.301_0
       0 女性系统/N94.401_0
       0 女性系统/N95.101_0
       0 女性系统/N95.201_0
       0 女性系统/N96xx01_0
       0 女性系统/N97.903_0
       0 女性系统/N97.904_0
       0 女性系统/O00.901_0
       0 女性系统/O20.001_0
       0 循环系统/I09.901_0
       0 循环系统/I10xx02_0
     602 循环系统/I11.901_0
      38 循环系统/I20.805_0
       0 循环系统/I24.803_0
       0 循环系统/I27.901_0
       0 循环系统/I42.002_0
       0 循环系统/I49.904_0
     306 循环系统/I50.904_0
       0 循环系统/I50.905_0
       0 循环系统/I51.403_0
       0 循环系统/I73.101_0
       0 循环系统/I80.205_0
       0 循环系统/I83.904_0
       0 泌尿生殖/C61xx01_0
       0 泌尿生殖/C64xx01_0
       0 泌尿生殖/C67.901_0
       0 泌尿生殖/E14.221+N08.3*_0
       0 泌尿生殖/I86.102_0
       0 泌尿生殖/N00.901_0
       0 泌尿生殖/N02.801_0
       0 泌尿生殖/N03.901_0
       0 泌尿生殖/N04.903_0
       0 泌尿生殖/N10xx01_0
       0 泌尿生殖/N13.301_0
       0 泌尿生殖/N18.905_0
       0 泌尿生殖/N20.005_0
       0 泌尿生殖/N20.101_0
       0 泌尿生殖/N21.001_0
       0 泌尿生殖/N39.001_0
     574 泌尿生殖/N39.002_0
       0 泌尿生殖/N40xx01_0
       0 泌尿生殖/N41.901_0
       0 泌尿生殖/N43.301_0
       0 泌尿生殖/N45.901_0
       0 泌尿生殖/N45.902_0
       0 泌尿生殖/N47xx01_0
       0 泌尿生殖/N48.101_0
       0 泌尿生殖/N49.001_0
      18 泌尿生殖/Q61.001_0
       0 消化系统/A09.901_0
       0 消化系统/B18.106_0
       0 消化系统/B18.201_0
       0 消化系统/C15.901_0
       0 消化系统/C16.902_0
       0 消化系统/C18.902_0
       0 消化系统/C20xx01_0
       0 消化系统/C22.901_0
       0 消化系统/C25.901_0
       0 消化系统/D18.030_0
       0 消化系统/I84.901_0
       0 消化系统/K21.001_0
       0 消化系统/K22.002_0
       0 消化系统/K25.901_0
       0 消化系统/K26.901_0
       0 消化系统/K29.101_0
       0 消化系统/K29.501_0
       0 消化系统/K31.701_0
       0 消化系统/K35.901_0
       0 消化系统/K36xx02_0
       0 消化系统/K40.900_0
      92 消化系统/K41.901_0
       0 消化系统/K50.900_0
       0 消化系统/K51.901_0
     972 消化系统/K56.101_0
       0 消化系统/K56.702_0
       0 消化系统/K58.903_0
       0 消化系统/K59.001_0
       0 消化系统/K60.201_0
       0 消化系统/K60.301_0
       0 消化系统/K61.002_0
       0 消化系统/K62.101_0
       0 消化系统/K62.806_0
       0 消化系统/K62.815_0
       0 消化系统/K63.582_0
       0 消化系统/K65.902_0
       0 消化系统/K71.601_0
       0 消化系统/K74.609_0
       0 消化系统/K76.001_0
       0 消化系统/K76.811_0
       0 消化系统/K80.203_0
       0 消化系统/K80.502_0
       0 消化系统/K81.004_0
       0 消化系统/K81.101_0
       0 消化系统/K82.808_0
       0 消化系统/K83.002_0
       0 消化系统/K85.901_0
       0 消化系统/K86.102_0
       0 消化系统/K92.204_0
       0 消化系统/K92.901_0
       0 消化系统/R94.501_0
       0 皮肤性病/A46xx01_0
       0 皮肤性病/A53.901_0
       0 皮肤性病/A60.002_0
       0 皮肤性病/A63.001_0
       0 皮肤性病/B01.901_0
       0 皮肤性病/B02.901_0
       0 皮肤性病/B35.003_0
       0 皮肤性病/B35.101_0
       0 皮肤性病/B35.301_0
       0 皮肤性病/B35.603_0
       0 皮肤性病/D17.902_0
       0 皮肤性病/D22.902_0
       0 皮肤性病/E14.550_0
       0 皮肤性病/I88.906_0
       0 皮肤性病/L03.091_0
       0 皮肤性病/L08.921_0
       0 皮肤性病/L23.902_0
       0 皮肤性病/L25.901_0
       0 皮肤性病/L27.003_0
       0 皮肤性病/L30.902_0
       0 皮肤性病/L40.901_0
       0 皮肤性病/L50.901_0
       0 皮肤性病/L70.901_0
       0 皮肤性病/L72.001_0
       0 皮肤性病/L72.101_0
       0 皮肤性病/L73.901_0
       0 皮肤性病/L75.001_0
       0 皮肤性病/L80xx02_0
       0 皮肤性病/M71.201_0
      41 皮肤性病/T14.001_0
       0 皮肤性病/T30.001_0
       3 皮肤性病/T35.701_0
      85 眼科/A74.001+H13.1*_0
      25 眼科/B30.901+H13.1*_0
       0 眼科/E14.371+H36.0*_0
       0 眼科/H00.003_0
     407 眼科/H02.002_0
      27 眼科/H02.003_0
       0 眼科/H04.401_0
     456 眼科/H04.503_0
       0 眼科/H10.101_0
       0 眼科/H10.902_0
       0 眼科/H11.001_0
       0 眼科/H16.901_0
       0 眼科/H20.904_0
       0 眼科/H26.901_0
       0 眼科/H33.202_0
       0 眼科/H40.902_0
       0 眼科/H52.701_0
       0 眼科/S01.105_0
       0 眼科/S05.104_0
       0 神经系统/D35.201_0
       0 神经系统/E14.423+G63.2*_0
       0 神经系统/F03xx01_0
       0 神经系统/F10.001_0
       0 神经系统/G20xx02_0
       0 神经系统/G30.901_0
       0 神经系统/G31.905_0
       0 神经系统/G35xx01_0
       0 神经系统/G40.901_0
       0 神经系统/G43.901_0
       0 神经系统/G44.001_0
       0 神经系统/G44.201_0
       0 神经系统/G45.901_0
       0 神经系统/G47.001_0
       0 神经系统/G50.002_0
       0 神经系统/G51.001_0
       0 神经系统/G58.001_0
       0 神经系统/G61.002_0
       0 神经系统/G62.901_0
       0 神经系统/H81.101_0
       0 神经系统/I61.902_0
       0 神经系统/I63.902_0
       0 神经系统/I63.903_0
       0 神经系统/I67.803_0
       0 神经系统/I69.101_0
       0 神经系统/I69.301_0
       0 神经系统/S01.001_0
       0 神经系统/T67.003_0
       0 耳鼻喉/C11.901_0
       0 耳鼻喉/H60.901_0
       0 耳鼻喉/H65.901_0
       0 耳鼻喉/H66.001_0
       0 耳鼻喉/H66.301_0
       0 耳鼻喉/H73.802_0
       0 耳鼻喉/H81.001_0
       0 耳鼻喉/H90.501_0
       0 耳鼻喉/J00xx04_0
       0 耳鼻喉/J01.901_0
       0 耳鼻喉/J02.903_0
       0 耳鼻喉/J03.904_0
       0 耳鼻喉/J04.003_0
       0 耳鼻喉/J30.401_0
       0 耳鼻喉/J31.002_0
       0 耳鼻喉/J31.201_0
       0 耳鼻喉/J32.902_0
       0 耳鼻喉/J33.901_0
       0 耳鼻喉/J34.201_0
       0 耳鼻喉/J35.001_0
       0 耳鼻喉/J37.002_0
       0 耳鼻喉/J38.102_0
       0 耳鼻喉/J38.203_0
       0 血液系统/C85.906_0
       0 血液系统/C90.001_0
       0 血液系统/C95.901_0
       0 血液系统/D46.901_0
       0 血液系统/D50.902_0
      82 血液系统/D53.101_0
       0 血液系统/D56.104_0
       0 血液系统/D56.901_0
       0 血液系统/D61.903_0
       0 血液系统/D66xx02_0
       0 血液系统/D69.001_0
       0 血液系统/D69.302_0
       0 运动系统/G56.001_0
      73 运动系统/G56.205_0
       0 运动系统/M19.991_0
       0 运动系统/M45xx091_0
       0 运动系统/M47.921_0
       0 运动系统/M48.061_0
       0 运动系统/M50.202_0
       0 运动系统/M51.202_0
       0 运动系统/M54.301_0
       0 运动系统/M54.501_0
       0 运动系统/M65.991_0
       0 运动系统/M65.992_0
       0 运动系统/M67.491_0
      87 运动系统/M71.991_0
       0 运动系统/M72.991_0
       0 运动系统/M75.003_0
       0 运动系统/M77.101_0
     148 运动系统/M85.652_0
       0 运动系统/M87.851_0
       0 运动系统/S22.321_0
       0 运动系统/S32.001_0
       0 运动系统/S42.001_0
       0 运动系统/S42.301_0
       0 运动系统/S42.411_0
       0 运动系统/S43.001_0
       0 运动系统/S52.011_0
       0 运动系统/S52.202_0
       0 运动系统/S52.302_0
       0 运动系统/S61.903_0
       0 运动系统/S62.301_0
       0 运动系统/S62.601_0
       0 运动系统/S72.001_0
       0 运动系统/S72.103_0
       5 运动系统/S72.201_0
       0 运动系统/S72.301_0
       0 运动系统/S82.001_0
       0 运动系统/S82.187_0
       0 运动系统/S82.211_0
       0 运动系统/S82.282_0
       0 运动系统/S82.401_0
       0 运动系统/S82.502_0
       0 运动系统/S82.602_0
       7 运动系统/S82.811_0
       0 运动系统/S83.201_0
       0 运动系统/S86.001_0
       0 运动系统/S92.001_0
       0 运动系统/S92.302_0
       0 运动系统/T09.205_0
       0 运动系统/W59.994_0
       0 风湿免疫/E79.001_0
       0 风湿免疫/G70.001_0
       0 风湿免疫/I00xx02_0
       0 风湿免疫/I73.001_0
       0 风湿免疫/M06.991_0
       0 风湿免疫/M10.991_0
       0 风湿免疫/M32.901_0
       0 风湿免疫/M33.101_0
       0 风湿免疫/M34.901_0
       0 风湿免疫/M35.006_0
       0 风湿免疫/M35.101_0
       0 风湿免疫/M35.102_0
       0 风湿免疫/M35.201_0""".split('\n'):
        count, key = data.strip().split(' ')
        systems, icd10_str = key.strip().split('/')
        icd10, xx = icd10_str.strip().split('_')
        print(count, systems, icd10)
        if icd10 not in _dict:
            _dict[icd10] = {
                'systems': systems,
                'count': 0,
                'icd10_name': disease_condition_dict[icd10]["icd10_name"]
            }

        _dict[icd10]['count'] += int(count)

    workbook = xlwt.Workbook(encoding='utf8')
    worksheet = workbook.add_sheet("脑图过滤剩余病历数", cell_overwrite_ok=True)
    worksheet.write(0, 0, label='所属系统')
    worksheet.write(0, 1, label='icd10')
    worksheet.write(0, 2, label='icd10_name')
    worksheet.write(0, 3, label='数目')
    j = 1
    for icd10, value in _dict.items():
        worksheet.write(j, 0, label=value['systems'])
        worksheet.write(j, 1, label=icd10)
        worksheet.write(j, 2, label=value['icd10_name'])
        worksheet.write(j, 3, label=value['count'])
        j += 1
    workbook.save('./脑图过滤剩余病历数统计结果2.xls')
